Examples/Lagrangian/angledDuctWithBalls/constant/hotParticleCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution {
    active          yes;
    coupled         true;
    transient true;
    cellValueSourceCorrection on;

    interpolationSchemes
    {
        rho             cell;
        mu              cell;
        U               cellPoint;
        T               cell;
        Cp              cell;
    }

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            hs              explicit 1;
        }
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}


constantProperties
{
    parcelTypeId    1;

    rhoMin           1e-15;
    TMin             200;
    minParticleMass  1e-15;
    rho0             2500;
    T0               500;
    Cp0              900;
    epsilon0         1;
    f0               0.5;
    Pr               0.7;

    pMin  1e4;
    constantVolume 1;
    Tvap   450;
    Tbp   370;

    youngsModulus   1e9;
    poissonsRatio   0.35;
}

subModels {
    particleForces
    {
        gravity         on;
        sphereDrag;
    }

    injectionModel  patchInjection;

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;

    radiation       off;

    patchInjectionCoeffs
    {
        SOI             0;
        massTotal        0.001;
        parcelBasisType mass;
        patchName inlet;
        duration 10;
        parcelsPerSecond 500;
        U0              ( 1 0 0 );
        flowRateProfile constant  1e-1;
        sizeDistribution
        {
            type         RosinRammler;
            RosinRammlerDistribution
            {
                minValue        5e-04;
                maxValue        0.005;
                d               5e-05;
                n               0.5;
            }
        }
    }

    ManualInjectionCoeffs
    {
        massTotal        0.0001;
        parcelBasisType mass;
        SOI             0;
        positionsFile   "thermoCloud1Positions";
        U0              ( 0 0 0 );
        parcelPDF
        {
            pdfType         RosinRammler;
            RosinRammlerPDF
            {
                minValue        5e-06;
                maxValue        0.0005;
                d               5e-05;
                n               0.5;
            }
        }
    }

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  off;
    }

    surfaceFilmModel none;
}

cloudFunctions
{
    patchPostProcessing {
        maxStoredParcels 10000;
        patches (
            outlet
        );
    }
}


// ************************************************************************* //
